---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.PrimaryUnits
source: html/2fc830c4-3e81-5a83-a110-d4e0f13cade3.htm
---
# Autodesk.Revit.DB.GroupTypeId.PrimaryUnits Property

Primary Units.

## Syntax (C#)
```csharp
public static ForgeTypeId PrimaryUnits { get; }
```